<html>
<head>
    <meta http-equiv=Content-Type content="text/html; charset=utf-8">
    <title>Учебно-тренировочные сборы по информатике 5</title>
    <link rel="stylesheet" type="text/css" href="../style/style.css">
    <script type="text/javascript" src="../syntax/sh_main.min.js"></script>
    <script type="text/javascript" src="../syntax/sh_pascal.min.js"></script>
    <script type="text/javascript" src="../syntax/sh_cpp.min.js"></script>
    <script type="text/javascript" src="../syntax/sh_python.min.js"></script>
    <script type="text/javascript" src="../syntax/sh_basic.js"></script>
    <link type="text/css" rel="stylesheet" href="../style/sh_nedit.css">
    <script type="text/x-mathjax-config">MathJax.Hub.Config({tex2jax: {inlineMath: [['$','$'], ['\\(','\\)']]}});

    </script>
    <script type="text/javascript"
            src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
    </script>
</head>
<body onLoad="sh_highlightDocument();">

<div id="content">
    <h1>Учебно-тренировочные сборы по информатике 5</h1>


<a href="http://lisiynos.googlecode.com/git/uts/uts1.html">
         http://lisiynos.googlecode.com/git/uts/uts1.html - первый день (понедельник)</a>

<h2>Задача B. Дипломы - БинПоиск по ответу</h2>

<p>
Когда Петя учился в школе, он часто участвовал в олимпиадах по информатике, математике и физике. 
Так как он был достаточно способным мальчиком и усердно учился, то на многих из этих олимпиад он получал дипломы. 
К окончанию школы у него скопилось $n$ дипломов, причем, как оказалось, все они имели одинаковые размеры: $w$ – в ширину и $h$ – в высоту.
</p>
<p>
Сейчас Петя учится в одном из лучших российских университетов и живет в общежитии со своими одногруппниками. 
Он решил украсить свою комнату, повесив на одну из стен свои дипломы за школьные олимпиады. 
Так как к бетонной стене прикрепить дипломы достаточно трудно, то он решил купить специальную доску из пробкового дерева, чтобы прикрепить ее к стене, а к ней – дипломы. Для того чтобы эта конструкция выглядела более красиво, Петя хочет, чтобы доска была квадратной и занимала как можно меньше места на стене. Каждый диплом должен быть размещен строго в прямоугольнике размером w на h. Прямоугольники, соответствующие различным дипломам, не должны иметь общих внутренних точек.
</p>
<p>
Требуется написать программу, которая вычислит минимальный размер стороны доски, которая потребуется Пете для размещения всех своих дипломов.
</p>

<p>Входной файл содержит три целых числа: $w, h, n$ $(1 \le w, h, n \le 10^9)$.</p>

<h3> Решение задачи </h3>

<p>
Ответ - ширина доски: пусть левая граница для него - $l$, правая - $r$.   </p>
<p>
Делим отрезок $[l, r]$ пополам, получаем центральный элемент $x = (r + l) div 2$.
</p>


<h3> Pascal </h3>
    <pre class="sh_pascal">
const max = 1e9; { Ограничения }
var
  w, h, l, r, x : int64;
  n : integer;
begin
  reset(input, 'diploma.in');
  rewrite(output, 'diploma.out');
  { Читаем входные данные }
  read(w, h, n);
  assert((1 <= w) and (w <= max)); { Ширина }
  assert((1 <= h) and (h <= max)); { Высота }
  assert((1 <= n) and (n <= max)); { Количество }
  { l - левая граница поиска - минимальная сторона доски }
  l := 0;
  { r - правая граница поиска - максимальная строна доски }
  r := (w + h) * n + 1; { берём с запасом, чтобы точно уместились }
  while (r - l > 1) do begin { Пока левая и правая граница не сойдутся в одной точке }
    x := (r + l) div 2; { делим отрезок [l, r] пополам }    
    if ((x div w) * (x div h) >= n) then begin
      { Можем уместить все дипломы => двигаем правую границу }
      r := x;
    end else begin
      { Не можем, доска слишком маленькая => двигаем левую границу }
      l := x;
    end;
  end;
  { Выводим ответ }
  writeln(r);
end.</pre> 

<h3>Пример</h3>

Дипломы: $2 x 3$ - $10$<br>
Левая граница поиска: $0$  
правая: $(w + h) * n + 1 = (2+3)*10 + 1 = 51$<br>
Делим отрезок $[0,51]$ пополам: $(0 + 51) div 2 = 25$<br>
По горизонтали: $25 div 2 = 12$ 
 вертикали: $25 div 3 = 8$ 
На доске 25 помещается: $12 * 8 = 96$<br>
Можем уместить все дипломы => двигаем правую границу r = 25<br>
Делим отрезок $[0,25]$ пополам: $(0 + 25) div 2 = 12$<br>
По горизонтали: $12 div 2 = 6$ 
 вертикали: $12 div 3 = 4$ 
На доске 12 помещается: $6 * 4 = 24$<br>
Можем уместить все дипломы => двигаем правую границу r = 12<br>
Делим отрезок $[0,12]$ пополам: $(0 + 12) div 2 = 6$<br>
По горизонтали: $6 div 2 = 3$ 
 вертикали: $6 div 3 = 2$ 
На доске 6 помещается: $3 * 2 = 6$<br>
Не можем, доска слишком маленькая => двигаем левую границу l = 6<br>
Делим отрезок $[6,12]$ пополам: $(6 + 12) div 2 = 9$<br>
По горизонтали: $9 div 2 = 4$ 
 вертикали: $9 div 3 = 3$ 
На доске 9 помещается: $4 * 3 = 12$<br>
Можем уместить все дипломы => двигаем правую границу r = 9<br>
Делим отрезок $[6,9]$ пополам: $(6 + 9) div 2 = 7$<br>
По горизонтали: $7 div 2 = 3$ 
 вертикали: $7 div 3 = 2$ 
На доске 7 помещается: $3 * 2 = 6$<br>
Не можем, доска слишком маленькая => двигаем левую границу l = 7<br>
Делим отрезок $[7,9]$ пополам: $(7 + 9) div 2 = 8$<br>
По горизонтали: $8 div 2 = 4$ 
 вертикали: $8 div 3 = 2$ 
На доске 8 помещается: $4 * 2 = 8$<br>
Не можем, доска слишком маленькая => двигаем левую границу l = 8<br>
Ответ: 9




</div>
</body>
</html>